app/controllers/orders_controller.rb

INSERT INTO "orders" ("service_id", "price", "quantity", "user_id", "total_price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["service_id", 1], ["price", 1000], ["quantity", 1], ["user_id", 1], ["total_price", 1000], ["created_at", "2017-07-16 16:08:00.060956"], ["updated_at", "2017-07-16 16:08:00.060956"]]
---
  def create
    order_data = order_params
    order_data['total_price'] = order_data['price'].to_i * order_data['quantity'].to_i
    Order.create!(order_data)

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ?  [["user_id", 1]]
SELECT "services".* FROM "services" WHERE "services"."id" IN (1, 2, 6)
---
  def user_orders
  @orders = current_user.orders.includes(:service)