app/controllers/pages_controller.rb

SELECT  "services".* FROM "services"  ORDER BY id desc LIMIT 4
---
  def home
  	@gigs = Service.limit(4).order('id desc')