app/controllers/services_controller.rb

  def create
    # TODO: Save the newly created service. Redirect to an appropriate page if save fails.
    @service = Service.new(service_params)
    respond_to do |format|
      if @service.save
---
INSERT INTO "services" ("title", "description", "price", "requirements", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def get_all_services
    @services = Service.all
---
SELECT "services".* FROM "services"